# IEntryPoint Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IEntryPoint Members
IEntryPoint Interface Methods Properties See Also
---
The IEntryPoint type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FinishInitialization |
| Initialize |
| OnShutdown |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddinFolder |

# See Also
IEntryPoint Interface
Autodesk.Revit.DB.Macros Namespace